Cyve-var/STM32G431-Vin/digithingSTM32G431Blinky-master/SW/EmbSrc/Src/STM32G431/STM32G431_GPIOF_Def.h
// Base Addres of GPIOF = 0x48001400

#define STM32G431_GPIOF_MODER_RESET_VALUE 0xFFFFFFFF
typedef struct {
    unsigned long MODER0 : 2;
    unsigned long MODER1 : 2;
    unsigned long MODER2 : 2;
    unsigned long MODER3 : 2;
    unsigned long MODER4 : 2;
    unsigned long MODER5 : 2;
    unsigned long MODER6 : 2;
    unsigned long MODER7 : 2;
    unsigned long MODER8 : 2;
    unsigned long MODER9 : 2;
    unsigned long MODER10 : 2;
    unsigned long MODER11 : 2;
    unsigned long MODER12 : 2;
    unsigned long MODER13 : 2;
    unsigned long MODER14 : 2;
    unsigned long MODER15 : 2;
} sSTM32G431_GPIOF_MODER;

typedef union {
    sSTM32G431_GPIOF_MODER Bit;
    unsigned long  All;
} uSTM32G431_GPIOF_MODER;

#define STM32G431_GPIOF_OTYPER_RESET_VALUE 0x00000000
typedef struct {
    unsigned long OT0 : 1;
    unsigned long OT1 : 1;
    unsigned long OT2 : 1;
    unsigned long OT3 : 1;
    unsigned long OT4 : 1;
    unsigned long OT5 : 1;
    unsigned long OT6 : 1;
    unsigned long OT7 : 1;
    unsigned long OT8 : 1;
    unsigned long OT9 : 1;
    unsigned long OT10 : 1;
    unsigned long OT11 : 1;
    unsigned long OT12 : 1;
    unsigned long OT13 : 1;
    unsigned long OT14 : 1;
    unsigned long OT15 : 1;
    unsigned long Res0 : 16;
} sSTM32G431_GPIOF_OTYPER;

typedef union {
    sSTM32G431_GPIOF_OTYPER Bit;
    unsigned long  All;
} uSTM32G431_GPIOF_OTYPER;

#define STM32G431_GPIOF_OSPEEDR_RESET_VALUE 0x00000000
typedef struct {
    unsigned long OSPEEDR0 : 2;
    unsigned long OSPEEDR1 : 2;
    unsigned long OSPEEDR2 : 2;
    unsigned long OSPEEDR3 : 2;
    unsigned long OSPEEDR4 : 2;
    unsigned long OSPEEDR5 : 2;
    unsigned long OSPEEDR6 : 2;
    unsigned long OSPEEDR7 : 2;
    unsigned long OSPEEDR8 : 2;
    unsigned long OSPEEDR9 : 2;
    unsigned long OSPEEDR10 : 2;
    unsigned long OSPEEDR11 : 2;
    unsigned long OSPEEDR12 : 2;
    unsigned long OSPEEDR13 : 2;
    unsigned long OSPEEDR14 : 2;
    unsigned long OSPEEDR15 : 2;
} sSTM32G431_GPIOF_OSPEEDR;

typedef union {
    sSTM32G431_GPIOF_OSPEEDR Bit;
    unsigned long  All;
} uSTM32G431_GPIOF_OSPEEDR;

#define STM32G431_GPIOF_PUPDR_RESET_VALUE 0x00000000
typedef struct {
    unsigned long PUPDR0 : 2;
    unsigned long PUPDR1 : 2;
    unsigned long PUPDR2 : 2;
    unsigned long PUPDR3 : 2;
    unsigned long PUPDR4 : 2;
    unsigned long PUPDR5 : 2;
    unsigned long PUPDR6 : 2;
    unsigned long PUPDR7 : 2;
    unsigned long PUPDR8 : 2;
    unsigned long PUPDR9 : 2;
    unsigned long PUPDR10 : 2;
    unsigned long PUPDR11 : 2;
    unsigned long PUPDR12 : 2;
    unsigned long PUPDR13 : 2;
    unsigned long PUPDR14 : 2;
    unsigned long PUPDR15 : 2;
} sSTM32G431_GPIOF_PUPDR;

typedef union {
    sSTM32G431_GPIOF_PUPDR Bit;
    unsigned long  All;
} uSTM32G431_GPIOF_PUPDR;

#define STM32G431_GPIOF_IDR_RESET_VALUE 0x00000000
typedef struct {
    unsigned long IDR0 : 1;
    unsigned long IDR1 : 1;
    unsigned long IDR2 : 1;
    unsigned long IDR3 : 1;
    unsigned long IDR4 : 1;
    unsigned long IDR5 : 1;
    unsigned long IDR6 : 1;
    unsigned long IDR7 : 1;
    unsigned long IDR8 : 1;
    unsigned long IDR9 : 1;
    unsigned long IDR10 : 1;
    unsigned long IDR11 : 1;
    unsigned long IDR12 : 1;
    unsigned long IDR13 : 1;
    unsigned long IDR14 : 1;
    unsigned long IDR15 : 1;
    unsigned long Res0 : 16;
} sSTM32G431_GPIOF_IDR;

typedef union {
    sSTM32G431_GPIOF_IDR Bit;
    unsigned long  All;
} uSTM32G431_GPIOF_IDR;

#define STM32G431_GPIOF_ODR_RESET_VALUE 0x00000000
typedef struct {
    unsigned long ODR0 : 1;
    unsigned long ODR1 : 1;
    unsigned long ODR2 : 1;
    unsigned long ODR3 : 1;
    unsigned long ODR4 : 1;
    unsigned long ODR5 : 1;
    unsigned long ODR6 : 1;
    unsigned long ODR7 : 1;
    unsigned long ODR8 : 1;
    unsigned long ODR9 : 1;
    unsigned long ODR10 : 1;
    unsigned long ODR11 : 1;
    unsigned long ODR12 : 1;
    unsigned long ODR13 : 1;
    unsigned long ODR14 : 1;
    unsigned long ODR15 : 1;
    unsigned long Res0 : 16;
} sSTM32G431_GPIOF_ODR;

typedef union {
    sSTM32G431_GPIOF_ODR Bit;
    unsigned long  All;
} uSTM32G431_GPIOF_ODR;

#define STM32G431_GPIOF_BSRR_RESET_VALUE 0x00000000
typedef struct {
    unsigned long BS0 : 1;
    unsigned long BS1 : 1;
    unsigned long BS2 : 1;
    unsigned long BS3 : 1;
    unsigned long BS4 : 1;
    unsigned long BS5 : 1;
    unsigned long BS6 : 1;
    unsigned long BS7 : 1;
    unsigned long BS8 : 1;
    unsigned long BS9 : 1;
    unsigned long BS10 : 1;
    unsigned long BS11 : 1;
    unsigned long BS12 : 1;
    unsigned long BS13 : 1;
    unsigned long BS14 : 1;
    unsigned long BS15 : 1;
    unsigned long BR0 : 1;
    unsigned long BR1 : 1;
    unsigned long BR2 : 1;
    unsigned long BR3 : 1;
    unsigned long BR4 : 1;
    unsigned long BR5 : 1;
    unsigned long BR6 : 1;
    unsigned long BR7 : 1;
    unsigned long BR8 : 1;
    unsigned long BR9 : 1;
    unsigned long BR10 : 1;
    unsigned long BR11 : 1;
    unsigned long BR12 : 1;
    unsigned long BR13 : 1;
    unsigned long BR14 : 1;
    unsigned long BR15 : 1;
} sSTM32G431_GPIOF_BSRR;

typedef union {
    sSTM32G431_GPIOF_BSRR Bit;
    unsigned long  All;
} uSTM32G431_GPIOF_BSRR;

#define STM32G431_GPIOF_LCKR_RESET_VALUE 0x00000000
typedef struct {
    unsigned long LCK0 : 1;
    unsigned long LCK1 : 1;
    unsigned long LCK2 : 1;
    unsigned long LCK3 : 1;
    unsigned long LCK4 : 1;
    unsigned long LCK5 : 1;
    unsigned long LCK6 : 1;
    unsigned long LCK7 : 1;
    unsigned long LCK8 : 1;
    unsigned long LCK9 : 1;
    unsigned long LCK10 : 1;
    unsigned long LCK11 : 1;
    unsigned long LCK12 : 1;
    unsigned long LCK13 : 1;
    unsigned long LCK14 : 1;
    unsigned long LCK15 : 1;
    unsigned long LCKK : 1;
    unsigned long Res0 : 15;
} sSTM32G431_GPIOF_LCKR;

typedef union {
    sSTM32G431_GPIOF_LCKR Bit;
    unsigned long  All;
} uSTM32G431_GPIOF_LCKR;

#define STM32G431_GPIOF_AFRL_RESET_VALUE 0x00000000
typedef struct {
    unsigned long AFRL0 : 4;
    unsigned long AFRL1 : 4;
    unsigned long AFRL2 : 4;
    unsigned long AFRL3 : 4;
    unsigned long AFRL4 : 4;
    unsigned long AFRL5 : 4;
    unsigned long AFRL6 : 4;
    unsigned long AFRL7 : 4;
} sSTM32G431_GPIOF_AFRL;

typedef union {
    sSTM32G431_GPIOF_AFRL Bit;
    unsigned long  All;
} uSTM32G431_GPIOF_AFRL;

#define STM32G431_GPIOF_AFRH_RESET_VALUE 0x00000000
typedef struct {
    unsigned long AFRH8 : 4;
    unsigned long AFRH9 : 4;
    unsigned long AFRH10 : 4;
    unsigned long AFRH11 : 4;
    unsigned long AFRH12 : 4;
    unsigned long AFRH13 : 4;
    unsigned long AFRH14 : 4;
    unsigned long AFRH15 : 4;
} sSTM32G431_GPIOF_AFRH;

typedef union {
    sSTM32G431_GPIOF_AFRH Bit;
    unsigned long  All;
} uSTM32G431_GPIOF_AFRH;

#define STM32G431_GPIOF_BRR_RESET_VALUE 0x00000000
typedef struct {
    unsigned long BR0 : 1;
    unsigned long BR1 : 1;
    unsigned long BR2 : 1;
    unsigned long BR3 : 1;
    unsigned long BR4 : 1;
    unsigned long BR5 : 1;
    unsigned long BR6 : 1;
    unsigned long BR7 : 1;
    unsigned long BR8 : 1;
    unsigned long BR9 : 1;
    unsigned long BR10 : 1;
    unsigned long BR11 : 1;
    unsigned long BR12 : 1;
    unsigned long BR13 : 1;
    unsigned long BR14 : 1;
    unsigned long BR15 : 1;
    unsigned long Res0 : 16;
} sSTM32G431_GPIOF_BRR;

typedef union {
    sSTM32G431_GPIOF_BRR Bit;
    unsigned long  All;
} uSTM32G431_GPIOF_BRR;

typedef struct {
    uSTM32G431_GPIOF_MODER STM32G431_GPIOF_MODER; // Offset: 0x0
    uSTM32G431_GPIOF_OTYPER STM32G431_GPIOF_OTYPER; // Offset: 0x4
    uSTM32G431_GPIOF_OSPEEDR STM32G431_GPIOF_OSPEEDR; // Offset: 0x8
    uSTM32G431_GPIOF_PUPDR STM32G431_GPIOF_PUPDR; // Offset: 0xc
    uSTM32G431_GPIOF_IDR STM32G431_GPIOF_IDR; // Offset: 0x10
    uSTM32G431_GPIOF_ODR STM32G431_GPIOF_ODR; // Offset: 0x14
    uSTM32G431_GPIOF_BSRR STM32G431_GPIOF_BSRR; // Offset: 0x18
    uSTM32G431_GPIOF_LCKR STM32G431_GPIOF_LCKR; // Offset: 0x1c
    uSTM32G431_GPIOF_AFRL STM32G431_GPIOF_AFRL; // Offset: 0x20
    uSTM32G431_GPIOF_AFRH STM32G431_GPIOF_AFRH; // Offset: 0x24
    uSTM32G431_GPIOF_BRR STM32G431_GPIOF_BRR; // Offset: 0x28
} sSTM32G431_GPIOF;

